cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Dev
brew "hivemind"
brew "kubectl"
cask "google-cloud-sdk"
brew "sqlite"
brew "ansible"
brew "httpie"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "ripgrep"
brew "the_silver_searcher"
brew "gh"

# Tools
cask "google-chrome"
cask "appcleaner"
cask "the-unarchiver"
cask "tunnelbear"
cask "transmission"
cask "zoom"
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "docker"
cask "firefox-developer-edition"
cask "fluor"
cask "anki"
cask "kitty"

# Mac App Store items
brew "mas"
mas "Telegram", id: 747648890
mas "Flow", id: 1423210932
